In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [25]:
salary_df = pd.read_excel('./data/players salary.xlsx')
players_cv = pd.read_excel('./data/players cv.xlsx')

# Players cv

In [30]:
players_cv.head()

,Player,Place_of_Birth,Race,From,To,Pos,Ht,Wt,Birth Date,College
0,Alaa Abdelnaby,Egypt,Black and White,1991,1995,F-C,6-10,240,"June 24, 1968",Duke University
1,Kareem Abdul-Jabbar*,New York,Black,1970,1989,C,7-2,225,"April 16, 1947","University of California, Los Angeles"
2,Mahmoud Abdul-Rauf,Mississippi,Black,1991,2001,G,6-1,162,"March 9, 1969",Louisiana State University
3,Tariq Abdul-Wahad,France,White,1998,2003,F,6-6,223,"November 3, 1974",San Jose State University
4,Shareef Abdur-Rahim,Georgia,Black,1997,2008,F,6-9,225,"December 11, 1976",University of California

In [31]:
players_cv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2485 entries, 0 to 2484
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Player          2485 non-null   object
 1   Place_of_Birth  2485 non-null   object
 2   Race            2485 non-null   object
 3   From            2485 non-null   int64
 4   To              2485 non-null   int64
 5   Pos             2485 non-null   object
 6   Ht              2485 non-null   object
 7   Wt              2485 non-null   int64
 8   Birth Date      2485 non-null   object
 9   College         2236 non-null   object
dtypes: int64(3), object(7)
memory usage: 194.3+ KB

We have some missing values in the column College.

In [36]:
print('Number of players in the cv dataframe')
len(players_cv['Player'].unique())

Number of players in the cv dataframe

2460

In [37]:
players_cv['Race'].unique()

array(['Black and White', 'Black', 'White', 'Others', 'White '],
      dtype=object)

In [40]:
print('Number of places of birth')
len(players_cv['Place_of_Birth'].unique())

Number of places of birth

183

In [41]:
print('How many colleges in the df ?')
len(players_cv['College'].unique())

How many colleges in the df ?

333

In [ ]:
players_cv.groupby

In [17]:
salary_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6168 entries, 0 to 6167
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   SEASON  6168 non-null   object
 1   RK      6168 non-null   int64
 2   NAME    6168 non-null   object
 3   TEAM    6168 non-null   object
 4   SALARY  6168 non-null   int64
dtypes: int64(2), object(3)
memory usage: 241.1+ KB

In [24]:
salary_df.sort_values('SALARY', ascending=False)

         SEASON   RK                 NAME                    TEAM    SALARY
2491  2012-2013    1      Kobe Bryant, SF      Los Angeles Lakers  30453805
2499  2013-2014    1      Kobe Bryant, SF      Los Angeles Lakers  30453805
2812  2004-2005    1  Shaquille O'Neal, C              Miami Heat  29464000
3207  2003-2004    1    Kevin Garnett, PF  Minnesota Timberwolves  28000000
2396  2003-2004    2  Shaquille O'Neal, C      Los Angeles Lakers  26571000
...         ...  ...                  ...                     ...       ...
4212  2009-2010  424     Greg Stiemsma, C           Orlando Magic      5383
3465  2007-2008  417     Billy Thomas, SG         New Jersey Nets      4533
5567  2007-2008  416   Linton Johnson, PF         Toronto Raptors      4533
2650  2009-2010  425     Tony Gaffney, SF       Memphis Grizzlies      2692
285   2009-2010  426  Oliver Lafayette, G          Boston Celtics      2692

[6168 rows x 5 columns]

In [13]:
len(salary['NAME'].unique())

1328